#include "CX3DParser.h"
#include "Test.h"

// ===============================================================
//  VRMLファイルの内容を表示する
// ===============================================================

void Test_printVRML(CX3DParser& parser, char *vrmlFile)
{
	// ---------------------------------------------
	//  VRMLファイルをパースする
	// ---------------------------------------------
	if (!parser.parse(vrmlFile))
	{
		fprintf(stderr, "%s parse failed\n", vrmlFile);
		return;
	}

	// ---------------------------------------------
	//  パース結果を表示する
	// ---------------------------------------------
	parser.print();
}